INSERT INTO courses 
(course_code, course_name, course_detail, course_group, credit, permission, program_type)
VALUES
(N'คพ100', N'เทคโนโลยีสารสนเทศเบื้องต้น',
N'หลักการพื้นฐานเกี่ยวกับระบบคอมพิวเตอร์ การทำงานของซอฟต์แวร์และฮาร์ดแวร์ การจัดการไฟล์และระบบปฏิบัติการเบื้องต้น',
N'วิชาเฉพาะด้าน (บังคับร่วม)', 3, N'เกรดไม่ต่ำกว่า2', N'S'),

(N'คพ101', N'โครงสร้างแบบไม่ต่อเนื่อง',
N'ตรรกศาสตร์เบื้องต้น การพิสูจน์ เซต ฟังก์ชัน ความสัมพันธ์ กราฟ และพีชคณิตบูลีน',
N'วิชาแกน', 3, N'เกรดไม่ต่ำกว่า2', N'S'),

(N'คพ102', N'พื้นฐานการแก้ปัญหาและการโปรแกรมคอมพิวเตอร์',
N'การแก้ปัญหาด้วยคอมพิวเตอร์ การเขียนโปรแกรมเชิงโครงสร้าง ชนิดของข้อมูล ฟังก์ชัน และการทดสอบโปรแกรม',
N'วิชาเฉพาะด้าน (บังคับร่วม)', 3, N'เกรดไม่ต่ำกว่า2', N'S'),

(N'คพ111', N'แนวคิดเชิงวัตถุ',
N'พื้นฐานแนวคิด OOP และกระบวนการพัฒนาซอฟต์แวร์เชิงวัตถุ',
N'วิชาเฉพาะด้าน (บังคับร่วม)', 3, N'ต้องเคยศึกษา คพ102เเละเกรดไม่ต่ำกว่า2', N'S'),

(N'คพ213', N'การออกแบบและวิเคราะห์ขั้นตอนวิธี',
N'หลักการออกแบบอัลกอริทึม เทคนิคต่าง ๆ เช่น บรูทฟอร์ซ แบ่งแล้วเข้าตี กรีดี้ และพลวัต',
N'วิชาเฉพาะด้าน (บังคับเอก)', 3, N'ต้องเคยศึกษา คพ216', N'S'),

(N'คพ216', N'โครงสร้างข้อมูลและขั้นตอนวิธี',
N'โครงสร้างข้อมูลต่าง ๆ เช่น อาร์เรย์ ลิสต์ สแตค คิว ทรี กราฟ แฮช และการวิเคราะห์เวลา',
N'วิชาเฉพาะด้าน (บังคับเอก)', 3, N'ต้องเคยศึกษา คพ102', N'S'),

(N'คพ221', N'หลักการของระบบฐานข้อมูล',
N'พื้นฐานฐานข้อมูล การออกแบบ ER การเขียน SQL และการจัดการฐานข้อมูล',
N'วิชาเฉพาะด้าน (บังคับร่วม)', 3, N'ต้องเคยศึกษา คพ102', N'S'),


(N'คพ233', N'สถาปัตยกรรมคอมพิวเตอร์และระบบปฏิบัติการ',
N'สถาปัตยกรรมชุดคำสั่ง การประมวลผลแบบสายท่อ มัลติโพรเซสเซอร์ หน่วยความจำเสมือน แคช และระบบไฟล์',
N'วิชาเฉพาะด้าน (บังคับเอก)', 3, N'ต้องเคยศึกษา คพ111', N'S'),


(N'คพ232', N'ระบบไมโครคอนโทรลเลอร์',
N'พื้นฐานสถาปัตยกรรมไมโครคอนโทรลเลอร์ การเขียนโปรแกรมระดับต่ำ การเชื่อมต่ออุปกรณ์อินพุตเอาต์พุต และการประยุกต์ใช้ไมโครคอนโทรลเลอร์ในงานจริง',
N'วิชาเฉพาะด้าน (บังคับเอก)', 3,
N'ต้องเคยศึกษา คพ111เเละเกรดไม่ต่ำกว่า2', N'S'),


(N'คพ240', N'หลักการวิทยาการข้อมูล',
N'พื้นฐานด้านข้อมูล วิธีวิเคราะห์ข้อมูลเชิงสถิติ การเรียนรู้ของเครื่อง และการนำเสนอข้อมูล',
N'วิชาเฉพาะด้าน (บังคับร่วม)', 3,
N'เกรดไม่ต่ำกว่า2', N'S'),


(N'คพ251', N'วิศวกรรมคอมพิวเตอร์เบื้องต้น',
N'พื้นฐานวงจรดิจิทัล อุปกรณ์อิเล็กทรอนิกส์ วิธีทำงานของซีพียู การสื่อสารสัญญาณ และการออกแบบวงจรดิจิทัลเบื้องต้น',
N'วิชาเฉพาะด้าน (บังคับเอก)', 3,
N'ต้องเคยศึกษา คพ101เเละเกรดไม่ต่ำกว่า2', N'S'),


(N'คพ261', N'เครือข่ายคอมพิวเตอร์',
N'พื้นฐานการสื่อสารข้อมูล โปรโตคอล มาตรฐาน และความปลอดภัยของเครือข่าย',
N'วิชาเฉพาะด้าน (บังคับร่วม)', 3, N'เกรดไม่ต่ำกว่า2', N'S'),

(N'คพ271', N'ระบบปฏิบัติการ',
N'การจัดการโปรเซส หน่วยความจำ การทำงานพร้อมกัน การจัดตาราง และระบบไฟล์',
N'วิชาเฉพาะด้าน (บังคับเอก)', 3, N'ต้องเคยศึกษา คพ233', N'S'),

(N'คพ281', N'การพัฒนาเว็บเบื้องต้น',
N'พื้นฐานการสร้างเว็บด้วย HTML, CSS, JavaScript และการทำงานของเว็บแบบไดนามิก',
N'วิชาเฉพาะด้าน (บังคับร่วม)', 3, N'ไม่มี', N'S');
